nxp-mcuxpresso/mcux-soc-svd/MCXA365/MCXA365.xml
        <register>
          <name>SGI_CONFIG</name>
          <description>SHA Configuration Reg</description>
          <addressOffset>0xD1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF0C05000</resetMask>
          <fields>
            <field>
              <name>ROW</name>
              <description>SGI Diversified for 'ROW'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHINA</name>
              <description>SGI Diversified for 'CHINA'</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CC</name>
              <description>SGI Diversified for 'CC'</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_AES</name>
              <description>HAS AES</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_DES</name>
              <description>HAS DES</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_SHA</name>
              <description>HAS SHA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_MOVEM</name>
              <description>HAS MOVEM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_CMAC</name>
              <description>HAS CMAC</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_GFMUL</name>
              <description>HAS GFMUL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERNAL_PRNG</name>
              <description>HAS INTERNAL PRNG</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_DIGEST</name>
              <description>HAS KEY DIGEST</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COUNT_SIZE</name>
              <description>0 - COUNT=16, 1 - COUNT=32</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FA</name>
              <description>HAS FA protection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS_WIDTH</name>
              <description>0 - BUS_WIDTH=16, 1 - BUS_WIDTH=32</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_DATIN</name>
              <description>NUMBER OF DATIN REGBANKS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_KEY</name>
              <description>NUMBER OR KEY REGBANKS</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EDC</name>
              <description>DATIN to KERNEL End-to-end EDC is enabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_256_ONLY</name>
              <description>HAS SHA-256 ONLY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPB_SUPPORT</name>
              <description>ID_CFG_SGI_SPB_SUPPORT is set</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPB_MASKING</name>
              <description>ID_CFG_SGI_SPB_MASKING is set</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFR_SW_MASK</name>
              <description>ID_CFG_SGI_USE_SFR_SW_MASK is set</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_CONFIG2</name>
          <description>SHA Configuration 2 Reg</description>
          <addressOffset>0xD20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFE00F800</resetMask>
          <fields>
            <field>
              <name>AES_USED</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>apollo</name>
                  <description>Apollo</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aegis</name>
                  <description>Aegis</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ayna</name>
                  <description>Ayna</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>athenium</name>
                  <description>Athenium</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ajax</name>
                  <description>Ajax</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aegis_hs</name>
                  <description>Aegis_hs</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>athenium_hs</name>
                  <description>Athenium_hs</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ate</name>
                  <description>ATE</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>atom</name>
                  <description>ATOM</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>asterix</name>
                  <description>Asterix</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_10</name>
                  <description>RFU</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_11</name>
                  <description>RFU</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_12</name>
                  <description>RFU</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_13</name>
                  <description>RFU</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_14</name>
                  <description>RFU</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_15</name>
                  <description>RFU</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_NUM_SBOXES</name>
              <description>Number of AES sboxes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AES_KEYSIZE</name>
              <description>Indicates which AES key size has been selected.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>aes_128_only</name>
                  <description>128 0nly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes_256_only</name>
                  <description>256 only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>all_keysize</name>
                  <description>All key sizes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DES_USED</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dakar</name>
                  <description>Dakar</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>danube</name>
                  <description>Danube</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>depicta</name>
                  <description>Depicta</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>digi</name>
                  <description>Digi</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>date</name>
                  <description>Date</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>desert</name>
                  <description>Desert</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_6</name>
                  <description>RFU</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_7</name>
                  <description>RFU</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_8</name>
                  <description>RFU</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_9</name>
                  <description>RFU</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_10</name>
                  <description>RFU</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_11</name>
                  <description>RFU</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_12</name>
                  <description>RFU</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_13</name>
                  <description>RFU</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_14</name>
                  <description>RFU</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu_15</name>
                  <description>RFU</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DES_NUM_SBOXES</name>
              <description>Number of DES sboxes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_AUTO_MODE</name>
          <description>SGI Auto Mode Control register</description>
          <addressOffset>0xD24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTO_MODE_EN</name>
              <description>auto_start_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>auto_mode_enabled</name>
                  <description>auto mode has been selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTO_MODE_STOP</name>
              <description>auto_mode_stop</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exit</name>
                  <description>exit auto mode as soon as the data has been emptied</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCR_MODE</name>
              <description>CTR increment mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>incr_mode_32</name>
                  <description>2**32 increment mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>incr_mode_64</name>
                  <description>2**64 increment mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>incr_mode_96</name>
                  <description>2**96 increment mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>incr_mode_128</name>
                  <description>2**128 increment mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>Auto mode of operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ecb</name>
                  <description>ECB mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctr</name>
                  <description>CTR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbc</name>
                  <description>CBC mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcmac</name>
                  <description>CBCMAC mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wrap_128_bit</name>
                  <description>Key Wrap/Unwrap (128 bit key data)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wrap_256_bit</name>
                  <description>Key Wrap/Unwrap (256 bit key data)</description>
                  <value>0x11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_AUTO_DMA_CTRL</name>
          <description>SGI Auto Mode Control register</description>
          <addressOffset>0xD28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFE</name>
              <description>Input FIFO DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>DMA handshake disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>DMA handshake enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFE</name>
              <description>Ouput FIFO DMA Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>DMA handshake disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>DMA handshake enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_PRNG_SW_SEED</name>
          <description>SGI internal PRNG SW seeding register</description>
          <addressOffset>0xD30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>32-bits SEED field. A write to the SEED field will seed the internal PRNG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_KEY_CTRL</name>
          <description>SGI Key Control SFR</description>
          <addressOffset>0xD40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY_WO</name>
              <description>SGI Key control register(1-bit per KEY SFR) 1'b0 - Key SFR is readable 1'b1 - Key SFR is not-readable(write-only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGI_KEY_WRAP</name>
          <description>Wrapped key read SFR</description>
          <addressOffset>0xD50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KW_DATA</name>
              <description>Field contains wrapped key, auto-updated by HW for each word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
